## Production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |             NAME              |
|--------|-------------------------------|
| update | `aws_iam_policy.ecr`          |
|        | `aws_lambda_alias.api_latest` |
|        | `aws_lambda_function.api`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecr" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda",
            ]
          + sid       = "AllowPushPull"
        }
      + statement {
          + actions   = [
              + "lambda:GetAlias",
              + "lambda:GetFunction",
              + "lambda:GetFunctionConfiguration",
              + "lambda:ListAliases",
              + "lambda:ListVersionsByFunction",
              + "lambda:PublishVersion",
              + "lambda:UpdateAlias",
              + "lambda:UpdateFunctionCode",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda",
            ]
          + sid       = "PermissionsToUpdateFunction"
        }
      + statement {
          + actions   = [
              + "lambda:GetLayerVersion",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
            ]
          + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
        }
    }

  # aws_iam_policy.ecr will be updated in-place
  ~ resource "aws_iam_policy" "ecr" {
        id          = "arn:aws:iam::296255494825:policy/ecr-api-lambda-access"
        name        = "ecr-api-lambda-access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = [
                          - "lambda:UpdateFunctionCode",
                          - "lambda:UpdateAlias",
                          - "lambda:PublishVersion",
                          - "lambda:ListVersionsByFunction",
                          - "lambda:ListAliases",
                          - "lambda:GetFunctionConfiguration",
                          - "lambda:GetFunction",
                          - "lambda:GetAlias",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                  - {
                      - Action   = "lambda:GetLayerVersion"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
                      - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_alias.api_latest will be updated in-place
  ~ resource "aws_lambda_alias" "api_latest" {
      ~ function_version = "434" -> (known after apply)
        id               = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:latest"
        name             = "latest"
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:434" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:434/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "434" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "AWS_XRAY_SDK_ENABLED"                  = "false"
                # (18 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
